import React from "react";
import { Box, Typography } from "@mui/material";
const ExamPaper2 = () => {
  return (
    <div>
      <Box mt={5}>
        <Box
          mt={2}
          sx={{
            backgroundColor: "background.paper",
            boxShadow: "3px 3px 30px 0px rgba(0, 0, 0, 0.08)",
            color: "text.secondary",
          }}
          p={3}
        >
          <Box display="flex" justifyContent="space-between">
            <Typography>سوال 1 از 5</Typography>
            <Typography>زمان پاسخگویی : 10 دقیقه</Typography>
            <Typography>نمره: 1 از 2</Typography>
          </Box>
          <Typography
            mt={4}
            sx={{
              lineHeight: 4,
            }}
            textAlign="left"
            color='text.primary'
          >
            1-لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
            استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
            کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد
          </Typography>
          <Typography
            mt={4}
            sx={{
              lineHeight: 4,
            }}
            textAlign="left"
          >
            لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با
            استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در
            ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و
            کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی
            در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را
            می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
            الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این
            صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و
            شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای
            اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد
            استفاده قرار گیرد.
          </Typography>
        </Box>
      </Box>
    </div>
  );
};

export default ExamPaper2;
