import React from "react";
import RightSide from "./right-side/rightSide";
import pic1 from "../../../assets/image/Component 79.png";
import pic2 from "../../../assets/image/Component 78.png";
import pic3 from "../../../assets/image/Component 80.png";
import pic4 from "../../../assets/image/Component 77.png";
import LeftSide from "./left-side/leftSide";



const Section3 = () => {
    return (
        <div>
            <div>
                <RightSide width={"544px"} pic={pic1} title="حواس پرتی" text="
ما در حین انجام کار با اطلاعات زیادی مواجه می‌شویم. محققان دریافته‌اند که مغز ما آن‌قدر برای حواس‌پرتی آماده است که فقط دیدن گوشی هوشمند می‌تواند توانایی تمرکز کردن را مختل کند." />
                <LeftSide width={"544px"} pic={pic2} title="خواب ناکافی"  text="کمبود خواب می‌تواند به کاهش هوشیاری، کندتر شدن فرآیندهای فکری و کاهش تمرکز منجر شود؛ در نتیجه، توانایی برای انجام وظایف، به خصوص کارهای مرتبط با استدلال یا منطق، به طور جدی تحت تاثیر قرار می‌گیرد." />
                <RightSide width={"850px"} pic={pic3} title="فعالیت بدنی ناکافی" text="آیا تا به حال متوجه شد‌ه‌اید که بعد از ورزش احساس آرامش و انرژی بیشتری می‌کنید؟ وقتی فعالیت بدنی انجام نمی‌دهید، عضلات شما منقبض می‌شوند؛ در نتیجه، ممکن است احساس سفتی در گردن، شانه و قفسه سینه تمرکز شما را تحت تاثیر قرار دهد." />
                <LeftSide width={"850px"} pic={pic4} title="عادات غذایی" text="آنچه که می‌خورید، روی سلامت مغز و میزان تمرکز شما تاثیر دارد. اگر مغز خود را با مواد مغذی مناسب تغذیه نکنید، مشکلاتی مانند از دست دادن حافظه، خستگی و حواس پرتی و عدم تمرکز را تجربه می‌کنید.
رژیم غذایی بسیار کم چرب می‌تواند تمرکز را کاهش دهد؛ چون مغز به اسیدهای چرب ضروری نیاز دارد. سایر رژیم‌های غذایی سخت و محدودکننده هم ممکن است به دلیل تامین نکردن مواد مغذی مورد نیاز مغز یا با ایجاد گرسنگی باعث حواس پرتی شده و روی تمرکز تاثیر منفی داشته باشند." />
            </div>
        </div>
      );
}
 
export default Section3;