import zPatternImg1 from "../assets/images/frahosh (1).png";
import zPatternImg2 from "../assets/images/medical.png";
import zPatternImg3 from "../assets/images/Group 648.png";

import {
  AngularDevelopment,
  ArtificialIntelligence,
  GraphicDesign,
  Mobiledevelopment,
  ReactDevelopment,
  SEOIcon,
  UXUIDesign,
  WebDevelopment,
} from "../assets/icons";

const fa = {
  home: {
    navbar: {
      logo: "فراهوش",
      works: "پروژه ها",
      aboutUs: "درباره ما",
      contactUs: "ارتباط با ما",
      call: "تماس با فراهوش",
      mag: "مجله آموزشی",
      language : "زبان"
    },
    banner: {
      welcome: "به دنیای جادویی",
      title: "فراهوش",
      subTitle: "خوش آمدید",
    },
    introduction: {
      title: "ما فراهوش هستیم",
      content:
        "داستان ما از دل کرونا سال 1399 شروع شد، وقتی کسب و کارها احساس نابودی می کردند و دنبال ورود به بازار بزرگتر بودند، فراهوش به کمک متخصصان ایرانی که تجربه کار بین المللی داشتند سعی کرد ایده ها و افکاری که روی کاغذ بودند را به واقعیت نزدیک تر کند. تجربه همکاری از شرکت های بزرگ تا کسب و کار های فروشگاهی نوپا به ما ثابت کرده برای به موفقیت رسیدن هر ایده ای باید تیم فنی متخصص و متعهد را در کنار خودمان داشته باشیم، همین امر باعث شد هر روز نسبت به قبل بیشتر یاد بگیریم و متخصصان جدیدی را به خانواده فراهوش اضافه کنیم تا همراهانی که با اعتماد به تیم فراهوش رونق بیشتری به کسب و کار خود دادند دیگر نگران دورانی مثل کرونا نباشند.",
    },
    services: {
      title: "خدمات ما",
      subTitle:
        "دوست داریم وقتی حرف از رونق کسب و کار ها و افزایش فروش به میان می آید لبخندی از آسودگی بر لبان ناخدایان کشتی کسب و کار ها بنشیند، باور داریم هر قطاری که با فناوری حرکت نکند در ارائه محصولات خود دچار مشکل می شود کنارتان خواهیم بود تا با سبدی متنوع از خدمات شما را به هدفتان نزدیک تر کنیم",
      items: [
        {
          title: "توسعه موبایل",
          imgSrc: Mobiledevelopment,
          color: "linear-gradient(93deg, #5BE2FF 0%, #066B81 108.3%)",
        },
        {
          title: "توسعه وب",
          imgSrc: WebDevelopment,
          color: "linear-gradient(92deg, #E1A4FF 0%, #8D26BE 100%)",
        },
        {
          title: "هوش مصنوعی",
          imgSrc: ArtificialIntelligence,
          color: "linear-gradient(93deg, #5BE2FF 0%, #066B81 108.3%)",
        },
        {
          title: "طراحی رابط کاربری",
          imgSrc: UXUIDesign,
          color: "linear-gradient(92deg, #E1A4FF 0%, #8D26BE 100%)",
        },
        {
          title: "توسعه ری‌اکت",
          imgSrc: ReactDevelopment,
          color: "linear-gradient(93deg, #5BE2FF 0%, #066B81 108.3%)",
        },
        {
          title: "توسعه انگولار",
          imgSrc: AngularDevelopment,
          color: "linear-gradient(92deg, #E1A4FF 0%, #8D26BE 100%)",
        },
        {
          title: "طراحی گرافیک",
          imgSrc: GraphicDesign,
          color: "linear-gradient(93deg, #5BE2FF 0%, #066B81 108.3%)",
        },
        {
          title: "سئو",
          imgSrc: SEOIcon,
          color: "linear-gradient(92deg, #E1A4FF 0%, #8D26BE 100%)",
        },
      ],
    },
    clients: {
      title: "مشتریان ما",
      slides: [
        { name: "گلگهر سیرجان" },
        { name: "مدرسه فراهوش" },
        { name: "کلینیک دکتر دانشمند" },
        { name: "فروشگاه آنالین رابو" },
        { name: "مرکز مشاوره دکتر ساکتی" },
      ],
    },
    ourWorks: {
      title: "برخی پروژه‌های فراهوش",
      items: [
        {
          title: "مدرسه فراهوش",
          content:
            "روزی به دنبال چراغ جادو بودیم تا بتواند در حوزه آموزش معجزه کند و با پیش بینی و پیشنهاد کمک کند بهترین ها را انتخاب کنیم و به سمت بهترین مسیر حرکت کنیم، با ایده مدرسه فراهوش به کمک هوش مصنوعی به دانش آموزان کمک میشود که در هر لحظه بهترین انتخاب را بر اساس نیاز شخصی خود داشته باشند. در این محصول نزدیک به 6 پنل کاربری همراه با سوپر اپلیکیشن فراهوش پیاده سازی شده است که همه ی افراد حوزه آموزش را به هم وصل میکند. ",
          lists: [
            { name: "پنل های کاربری متفاوت برای همه ی نیاز های آموزش" },
            { name: "سوپر اپلیکیشن برای دانش آموزان با نزدیک به 200 صفحه" },
            { name: " الگوریتم های هوش مصنوعی برای پیش بینی آموزشی" },
            { name: " الگوریتم های هوش مصنوعی برای هوشمند سازی ابزار آموزش" },
          ],
          viewAll: "view All",
          imgSrc: zPatternImg1,
        },
        {
          title: "کلینیک دکتر دانشمند",
          content:
            "در دنیای امروز تمام مشاغل به دنبال گسترش کسب و کار خود هستند، در جایی که شما بدون توجه به منطقه ی جغرافیایی خود میتوانید به برطرف کردن نیازهای جامعه هدف خود کمک کنید. ما در این پروژه به یک کلینیک پزشکی کمک کردیم تا با طراحی اپلیکیشن و سایت جامع در حوزه پزشکی با زیرمنوهای برگزاری آزمون، مدیتیشن، بازی و سرگرمی و .... به پیشرانان حوزه پزشکی تبدیل شوند و با درمان مراجعانی که حتی در کشور حضور ندارند شعبه های کلینیک خود را به سادگی در سرتاسر دنیا گسترش دهند، شاید شنیده باشید که در برخی از کشورهای برتر دنیا ربات هایی وجود دارند که برخی از کارهای طبابت را انجام می دهند!!! این تغییر در سطح بین المللی نشان از آینده حوزه تکنولوژی میدهد و در این پروژه سعی کردیم آغازکننده تحولی در این زمینه باشیم.",
          viewAll: "view All",
          imgSrc: zPatternImg2,
        },
        {
          title: "فروشگاه اینترنتی رابو",
          content:
            "پروسه سخت خرید در شبکه های اجتماعی علاوه بر اینکه مشتری را سردرگم می کند صاحب کسب وکار را با خطر از دست دادن بازار فروش خود در مواجه با تغییراتی مانند فیلترینگ  روبرو می کند؛ ما در این پروژه کنار رابو بودیم تا بتواند علاوه بر گسترش کسب و کار خود بدون دغدغه فنی، کار در فضای وب را تجربه کند. این سایت با توجه به تکنولوژی وردپرس هزینه بسیار پایینی برای کارفرما داشت. در طراحی وردپرس پنل ساده کاربری و پشتیبانی تیم فنی فراهوش به کارفرما کمک کرد تا بدون نیاز به هیچگونه دانش از طراحی سایت بتواند کسب و کار خود را گسترش دهد و در هر لحظه از شبانه روز فروش داشته باشد.",
          lists: [
            { name: " طراحی اختصاصی سایت فروش" },
            { name: " استفاده از فناوری وردپرس" },
            { name: " پشیبانی فنی با توجه به نیاز مشتری" },
            { name: " مشاوره در زمینه دیجیتال مارکتینگ" },
          ],
          viewAll: "view All",
          imgSrc: zPatternImg3,
        },
      ],
      viewAll: "مشاهده همه",
    },
    aboutUs: {
      title: "درباره فراهوش",
      content:
        "بسیاری از افراد و شرکت ها حضور موثر در فضای تکنولوژی را به عنوان فرآیندی نیازمند دانش فنی بالا، هزینه بر و دارای ریسک میشناسند. اما از نگاه ما، باتعهد و تخصص میتوان فضای کسب و کار مجازی را به کاری آسان و لذت بخش تبدیل کرد. ما ماموریت خود را کمک به پیاده سازی ایده ها و حضور کسب وکارها در فضای فناوری می دانیم و چشم انداز ما تبدیل شدن به مرجعی معتبر در زمینه راهکارها و دانش مرتبط با تکنولوژی است. ما ایمان داریم حال خوبی که برای هم میسازیم از بین نمیرود و همیشه کنار ماست.",
      teamMembers: "اعضای تیم",
      experience: "تجربه",
    },
    customerFeedback: {
      title: "نظر مشتریان فراهوش را بدانید...",
      items: [
        {
          customer: "مدرسه فراهوش",
          content:
            "اینکه یک تیم جوان کنارت باشه و بتوانه با متدهای روز تو را به سمت جلو حرکت بده فوق العاده است؛ از بچه های خوبتون ممنونم و امیدوارم همیشه موفق باشند            ",
          date: "شهریور 1402",
        },
        {
          customer: "کلینیک دکتر دانشمند",
          content: "تا الان نزدیک به 4 سایت مختلف برای کلینیک طراحی کردیم تا اینکه با این شرکت جهت عقد قرارداد آشنا شدیم، اینکه زبان یکدیگر را متوجه میشدیم باعث شد پروژه سریع تر حرکت کند          ",
          date: "خرداد 1402",
        },
      ],
    },
    askedQuestion: {
      title: "سوالات متداول",
      questions: [
        {
          title: "نحوه انعقاد قرارداد و شروع کار به چه شکلی هست؟",
          subTitle:
            "علاوه بر اینکه در دفاتر ما در شهرهای تهران، اصفهان و شیراز میتوانید بصورت حضوری قرارداد تنظیم کنید، میتوانیم قرارداد را بصورت فیزیکی به آدرس شما پست کنیم.",
        },
        {
          title: "مراحل تکمیل پروژه در فراهوش به چه صورت است؟",
          subTitle:
            "در مرحله اول همکاران فراهوش به صورت آنالین با شما جلسه برگزار و تمامی نیازهای شما را میسنجند در مرحله بعدی پروپوزال پیشنهادی فراهوش به دست شما خواهد رسید؛ در مرحله بعد فایل طراحی شده را شما تایید میکنید و پروژه در زمان مقرر به دست شما میرسد اما این انتهای کار نیست و ما به عنوان پشتیبان فنی در کنار شما هستیم.",
        },
        {
          title: "نحوه دریافت هزینه های پروژه به چه صورت هست؟",
          subTitle:
            "برای پرداخت هزینه ها در هنگام قرارداد میتوانید متناسب با شرایط خود پرداختی ها را در زمان های مختلف تضمین کنید.",
        },
        {
          title: "آیا نیاز است دانش فنی در حوزه طراحی سایت بلد باشیم؟",
          subTitle:
            "ما بصورت کامل در خدمت شما هستیم و هیچ گونه نیازی به دانش فنی نخواهید داشت.",
        },
        {
          title:
            "آموزش های کلی در مورد مدیریت پلتفرم را کجا باید بدست بیاوریم؟",
          subTitle:
            "ما همه ی مشکالت فنی شما را برطرف خواهیم کرد و نیازی به تخصص فنی ندارید، اما آموزش های کلی را در اختیار شما خواهیم گذاشت.",
        },
      ],
    },
    footer: {
      cantactUs: "با ما در تماس باشید ",
      form: {
        formTitle: "برای انجام پروژه‌های شگفت‌انگیز و فوق‌العاده آماده ایم...",
        FullName: "نام و نام خانوادگی",
        Email: "آدرس پست الکترونیکی",
        PhoneNumber: "شماره تماس",
        Message: "پیام",
        button: "ارسال پیام",
      },
      content: {
        title: "فراهوش",
        bodyText: "ما باور داریم تالش و تخصص نتیجه ها را دگرگون خواهد کرد.",
        works: "پروژه‌ها",
        aboutUs: "درباره ما",
        contactUs: "ارتباط با ما",
      },
    },
  },
};

export default fa;
